{"d1e3": {"l": "./chapter_4.html#topic_jgr_nnd_ddc","t": "Chapter 4","d": "<div class=\"abstract\"><p class=\"shortdesc\">The Infamous Willy Wonka and His Chocolate Factory The next day is the day everyone is invited to tour Wonka’s chocolate factory. Charlie arrives with his Grandpa Joe, who springs out of bed for the first time in decades. They arrive at the factory gates and are greeted by ...</p></div>"},"d1e10": {"l": "./chapter_2.html#topic_apd_tnd_ddc","t": "Chapter 2","d": "<div class=\"abstract\"><p class=\"shortdesc\">Five Golden Tickets After not being heard from for decades, Willy Wonka announces in the newspaper that he will allow five children to tour his chocolate factory. To win this exclusive chance, each child must find a golden ticket inside of a Wonka chocolate bar. Grandpa Joe...</p></div>"},"d1e17": {"l": "./chapter_1.html#topic_wtc_qnd_ddc","t": "Chapter 1","d": "<div class=\"abstract\"><p class=\"shortdesc\">Meet Charlie Bucket The main character of the story is Charlie Bucket. He is a poor young boy who lives in a small, cramped house with his parents and grandparents, since this is all they can afford. He passes by Willy Wonka’s chocolate factory every day and wishes he could...</p></div>"},"d1e24": {"l": "./chapter_8.html#topic_jgr_nnd_ddc","t": "Chapter 8","d": "<div class=\"abstract\"><p class=\"shortdesc\">Mike Teavee Mike Teavee is the fourth child to get separated from the group. After finally finding a television in the factory, this is all he can focus on. However, his hopes of getting on television do not turn out quite as expected as he is shrunk to fit inside a small t...</p></div>"},"d1e31": {"l": "./chapter_6.html#topic_jgr_nnd_ddc","t": "Chapter 6","d": "<div class=\"abstract\"><p class=\"shortdesc\">Veruca Salt Veruca Salt is the second child to get separated from the group. She is determined to be a “bad nut” by the squirrels. They decide to pick her up and throw her down the garbage shoot. Once she is thrown down, she is helped out before the trash gets taken out. Sh...</p></div>"},"d1e39": {"l": "./index.html#topic_g4t_ct2_bdc","t": "Charlie and the Chocolate Factory","d": "<div class=\"abstract\"><p class=\"shortdesc\">Charlie and the Chocolate Factory, written by Roald Dahl, is a long-standing, popular children’s book. It was first published in 1964 and has since been made into three movies and a musical. It follows the story of a poor young boy who wins a coveted golden ticket to tour W...</p></div>"},"d1e46": {"l": "./chapter_5.html#topic_jgr_nnd_ddc","t": "Chapter 5","d": "<div class=\"abstract\"><p class=\"shortdesc\">Augustus Gloop Augustus Gloop is the first child to get separated from the group. He is captivated by the chocolate river and unable to resist so he falls into the river while trying to drink it. He is quickly sucked up by one of the pipes and transported to another room. H...</p></div>"},"d1e53": {"l": "./chapter_7.html#topic_jgr_nnd_ddc","t": "Chapter 7","d": "<div class=\"abstract\"><p class=\"shortdesc\">Violet Beauregarde Violet Beauregarde is the third child to get separated from the group. She sees an experimental piece of bubblegum and determined to be the best, grabs it, despite being warned not to, and chews it. She quickly turns into a giant blueberry. After turning ...</p></div>"},"d1e60": {"l": "./chapter_3.html#topic_jgr_nnd_ddc","t": "Chapter 3","d": "<div class=\"abstract\"><p class=\"shortdesc\">The Other Four Tickets Charlie was the last child to find a golden ticket. Here's how the four other children found their golden tickets: Augustus Gloop The first child to find a golden ticket was Augustus Gloop. He is a kid who loves eating candy. Because he eats so much c...</p></div>"},"d1e67": {"l": "./chapter_9.html#topic_jgr_nnd_ddc","t": "Chapter 9","d": "<div class=\"abstract\"><p class=\"shortdesc\">The Surprise Winner After all the other children have gotten separated, Charlie is the only one left. After all the other children have died, Charlie is the only one left. Willy Wonka reveals that Charlie is now the winner! Willy Wonka was holding a secret contest for who w...</p></div>"}}